{"Metascore":"72","BoxOffice":"N\/A","Website":"N\/A","imdbRating":"7.9","imdbVotes":"185,602","Ratings":[{"Value":"7.9\/10","Source":"Internet Movie Database"},{"Value":"83%","Source":"Rotten Tomatoes"},{"Value":"72\/100","Source":"Metacritic"}],"Runtime":"118 min","Language":"English, Esperanto","Rated":"R","Production":"Electric City Entertainment","Released":"29 Jul 2016","imdbID":"tt3553976","Plot":"Ben and Leslie Cash have long lived largely off the grid with their offspring - Bodevan, Kielyr, Vespyr, Rellian, Zaja and Nai - in a cabin in the mountains of Washington state. The parents have passed their ideals to their children, namely socialism (in its various forms) and survivalism. With the former, Ben considers most of western society as being fascist, especially corporate America. With the latter, he figures that no one will or should be there for you, so you better learn how to take care of yourself in all its aspects. As such, the children have been subject to vigorous physical training, know how to deal with minor bumps, bruises, cuts, sprains and even fractures, and know how to hunt, forage and grow their own food. The children are also non-registered home schooled, meaning that they have no official academic records. Ben and Leslie have tried to make the children critical thinkers, however within the context of their ideals. Beyond these issues, Ben and Leslie made the decision to live this lifestyle for Leslie's health. Formerly a lawyer, Leslie was diagnosed as bipolar. Ben figures that this disorder started with her post-partum depression with Bo. Even with this lifestyle, Leslie's condition has become progressively worse. Despite not believing in western medicine, Ben, to deal with the illness, has sent Leslie to hospital, one close to Ben's sister, Harper, in Sacramento so that there can be family close by. While in hospital, Leslie is able to commit suicide. Beyond the collective grief, Leslie's act brings out a battle between Ben, and Leslie's father, Jack Bertrang, a wealthy Christian, who not only blames Ben for what happened to Leslie, but believes what he is doing to the children can legally be considered abuse. To be held in their church in New Mexico, Jack takes over the funeral arrangements to his and his complacent wife Abby's Christian morals, against what Ben knows was Leslie's wishes, she who believed in Buddhist philosophies. Although Jack threatens to call the police if Ben shows up to the funeral, he and the children believe it is the latest of their missions to rescue Leslie to honor her last wishes to be cremated as per Buddhist philosophies. This mission not only may bring the divide between Jack and Ben to a head, but may also bring out some long seated issues within the Cash children as they are exposed to commercial America in all its good and bad, and as Bo grows into manhood, he who may have his own ideas of what he should do with the next phase of his life.","Director":"Matt Ross","Title":"Captain Fantastic","Actors":"Viggo Mortensen, George MacKay, Samantha Isler, Annalise Basso","Response":"True","Type":"movie","Awards":"Nominated for 1 Oscar. Another 14 wins & 47 nominations.","DVD":"N\/A","Year":"2016","Poster":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMjE5OTM0OTY5NF5BMl5BanBnXkFtZTgwMDcxOTQ3ODE@._V1_SX300.jpg","Country":"USA","Genre":"Comedy, Drama","Writer":"Matt Ross"}
