{"Metascore":"61","BoxOffice":"N\/A","Website":"N\/A","imdbRating":"8.0","imdbVotes":"100,713","Ratings":[{"Value":"8.0\/10","Source":"Internet Movie Database"},{"Value":"69%","Source":"Rotten Tomatoes"},{"Value":"61\/100","Source":"Metacritic"}],"Runtime":"140 min","Language":"English, German, Czech","Rated":"R","Production":"Icelandic Film Corporation, FilmFour, Trust Film, Constantin Film Produktion, Blind Spot Pictures Oy, Cinematograph A\/S, What Else? B.V., Yleisradio, Danmarks Radio, Arte, Zentropa Entertainments, TV 1000, Liberator Productions, Lantia Cinema, SVT Drama, Angel Films A\/S, Canal+, Film i Väst, Westdeutscher Rundfunk, VPRO Television, Arte France Cinema, France 3 Cinéma","Released":"06 Oct 2000","imdbID":"tt0168629","Plot":"1964 in small town Washington state. Selma Jezková, a Czechoslovakian immigrant, and her preteen son Gene live in a rented trailer owned by and on the property of married Bill and Linda Houston, he the town sheriff. Beyond Bill and Linda, Selma has a small group of friends who look out for her, including her primary confidante, Kathy, with who she works, and Jeff who wants to be her boyfriend. Jeff regularly waits outside Selma's workplace long before the end of her shift to drive her home, despite she always refusing in not wanting to lead him on. Her primary job is working on the Anderson Tool factory assembly line, but she does whatever she can to earn money. What only Kathy knows among Selma's friends is that she is slowly going blind, her medical condition being genetic. Selma is barely able to see, just enough to do her job. Her primary reason for moving to the US and for working all the time is to earn enough money for an operation for Gene when he turns thirteen, he who doesn't know anything about his mother or his own degenerative eyesight. None of Selma's friends, not even Kathy, know about the money for Gene's operation. Beyond this sole goal of the operation, Selma allows only one indulgence in her life, anything having to do with musicals, which she loves, it an escape from the problems of her life. Kathy often takes her to the cinema to watch old musicals, Kathy who has to describe to Selma what is happening on the screen much to the other patrons' chagrin. Selma also has the lead of Maria in a community theater production of \"The Sound of Music\". Close to having enough money for the operation, Selma is in a race against time before she loses enough of her sight not to be able to work or participate in the musical production. What may also threaten Selma's goal of the operation for Gene is some financial problems facing Bill. He feels pressured to provide Linda with the comforts of life to which she is accustomed that he believes she requires in their marriage to be satisfied, and as such he is reluctant to tell Linda of those financial problems.","Director":"Lars von Trier","Title":"Dancer in the Dark","Actors":"Björk, Catherine Deneuve, David Morse, Peter Stormare","Response":"True","Type":"movie","Awards":"Nominated for 1 Oscar. Another 35 wins & 48 nominations.","DVD":"N\/A","Year":"2000","Poster":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNDVkYWMxNWEtNjc2MC00OGI5LWI3NmUtYWUwNDQyOTc3YmY5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg","Country":"Denmark, Germany, Netherlands, Italy, USA, UK, France, Sweden, Finland, Iceland, Argentina, Norway, Taiwan, Belgium","Genre":"Crime, Drama, Musical","Writer":"Lars von Trier"}
