{"Metascore":"82","BoxOffice":"N\/A","Website":"N\/A","imdbRating":"8.2","imdbVotes":"327,354","Ratings":[{"Value":"8.2\/10","Source":"Internet Movie Database"},{"Value":"90%","Source":"Rotten Tomatoes"},{"Value":"82\/100","Source":"Metacritic"}],"Runtime":"156 min","Language":"German, Russian, French, English","Rated":"R","Production":"Rai Cinema, Österreichischer Rundfunk (ORF) [at], Constantin Film Produktion, Degeto Film, EOS Entertainment","Released":"08 Apr 2005","imdbID":"tt0363163","Plot":"In April of 1945, Germany stands at the brink of defeat with the Soviet Armies closing in from the west and south. In Berlin, capital of the Third Reich, Adolf Hitler proclaims that Germany will still achieve victory and orders his Generals and advisers to fight to the last man. \"Downfall\" explores these final days of the Reich, where senior German leaders (such as Himmler and Goring) began defecting from their beloved Fuhrer, in an effort to save their own lives, while still others (Joseph Goebbels) pledge to die with Hitler. Hitler, himself, degenerates into a paranoid shell of a man, full of optimism one moment and suicidal depression the next. When the end finally does comes, and Hitler lies dead by his own hand, what is left of his military must find a way to end the killing that is the Battle of Berlin, and lay down their arms in surrender.","Director":"Oliver Hirschbiegel","Title":"Downfall","Actors":"Bruno Ganz, Alexandra Maria Lara, Corinna Harfouch, Ulrich Matthes","Response":"True","Type":"movie","Awards":"Nominated for 1 Oscar. Another 22 wins & 33 nominations.","DVD":"N\/A","Year":"2004","Poster":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTU0NTU5NTAyMl5BMl5BanBnXkFtZTYwNzYwMDg2._V1_SX300.jpg","Country":"Germany, Austria, Italy","Genre":"Biography, Drama, History, War","Writer":"Bernd Eichinger, Joachim Fest (based on the book \"Der Untergang: Hitler und das Ende des Dritten Reiches\" by), Traudl Junge (based on the book \"Bis zur letzten Stunde\" by), Melissa Müller (based on the book \"Bis zur letzten Stunde\" by)"}
