{"Metascore":"60","BoxOffice":"N\/A","Website":"N\/A","imdbRating":"7.7","imdbVotes":"583,716","Ratings":[{"Value":"7.7\/10","Source":"Internet Movie Database"},{"Value":"74%","Source":"Rotten Tomatoes"},{"Value":"60\/100","Source":"Metacritic"}],"Runtime":"129 min","Language":"English, Arabic, Swedish","Rated":"R","Production":"Marv Films, Cloudy","Released":"13 Feb 2015","imdbID":"tt2802144","Plot":"A young man named Eggsy whose father died when he was a young boy, is dealing with living with the creep his mother is with now, who mistreats her and him. He goes out and does something to one of the creep's friends. He gets arrested and he calls a number a man gave him around the time his father died, to call if he needs help. A man named Harry approaches him and tells him he's the one who helped him. He tells him that he knew his father. When the man Eggsy slighted wants some payback, Harry takes care of him and his companions single handed. Harry then tells Eggsy that he's part of a secret organization called the Kingsman and his father was also part of it. He died trying to make the world safe. Harry offers Eggsy the opportunity to be a Kingsman and he takes it. He undergoes a grueling training course. Harry is looking into the demise of another Kingsman and the trail leads him to tech billionaire named Valentine aka V who is also curious about the group following him, the Kingsman.","Director":"Matthew Vaughn","Title":"Kingsman: The Secret Service","Actors":"Adrian Quinton, Colin Firth, Mark Strong, Jonno Davies","Response":"True","Type":"movie","Awards":"8 wins & 27 nominations.","DVD":"N\/A","Year":"2014","Poster":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTkxMjgwMDM4Ml5BMl5BanBnXkFtZTgwMTk3NTIwNDE@._V1_SX300.jpg","Country":"UK, USA","Genre":"Action, Adventure, Comedy, Thriller","Writer":"Jane Goldman (screenplay by), Matthew Vaughn (screenplay by), Mark Millar (based on the comic book \"The Secret Service\" by), Dave Gibbons (based on the comic book \"The Secret Service\" by)"}
